/*----------------------------------------------------------------------------------------------------------------------/
        *               本程序只供购买者学习使用，版权著作权属于无名科创团队，
        *               无名科创团队将飞控程序源码提供给购买者，
        *               购买者要为无名科创团队提供保护，
        *               未经作者许可，不得将源代码提供给他人
        *               不得将源代码放到网上供他人免费下载，
        *               更不能以此销售牟利，如发现上述行为，
        *               无名科创团队将诉之以法律解决！！！
-----------------------------------------------------------------------------------------------------------------------/
        *               生命不息、奋斗不止；前人栽树，后人乘凉！！！
        *               开源不易，且学且珍惜，祝早日逆袭、进阶成功！！！
-----------------------------------------------------------------------------------------------------------------------/
	*		无名科创开源飞控   武汉科技大学  By.YuYi
	*		CSDN博客: http://blog.csdn.net/u011992534
	*               优酷ID：NamelessCotrun无名小哥
	*               无名科创开源飞控QQ群：540707961
        *               https://shop348646912.taobao.com/?spm=2013.1.1000126.2.5ce78a88ht1sO2
        *               百度贴吧:无名科创开源飞控
        *               修改日期:2018/6/16
        *               版本：V1.7.3.0
        *               版权所有，盗版必究。
        *               Copyright(C) 武汉科技大学无名科创团队 2017-2019
        *               All rights reserved
----------------------------------------------------------------------------------------------------------------------*/
#ifndef _CONTROL_CONFIG_H
#define _CONTROL_CONFIG_H

#define Self_Balance_Mode 1//自稳、纯姿态加油门补偿
#define High_Hold_Mode    2//定高模式
#define Pos_Free_Mode 1//水平位置no fixed
#define Pos_Hold_Mode 2//定点模式
//GPS定点下打杆控速模式与直接姿态角
#define Speed_Mode 0  //GPS定点模式下，打杆控速
#define Angle_Mode 1  //GPS定点模式下，打杆直接给姿态期望角

/*****************遥控器行程设置**********************/
#define  Climb_Up_Speed_Max    500//向上最大攀爬速度，cm/s 150 250  400
#define  Climb_Down_Speed_Max  100//向下最大下降速度，cm/s  80 120  180

/****************************************************************
           当油门推重比较小时，若上升下降期望加速度比较大，
           会导致输出映射的里面的姿态控制量得不到充分输出，
           使得快速上升下降时，姿态不平稳，若此过程持续时间长，
           会导致姿态长期得不到修正，直致最后炸鸡，故推重比较
           小时，可将期望加速度限小一点，或者做控制量优先级处理
*******************************************************************/
#define  Climb_Up_Acceleration_Max     500//向上最大攀爬加速度，cm/s^2 
#define  Climb_Down_Acceleration_Max   300//向下最大下降加速度，cm/s^2 



#define  Thr_Start  1100//起转油门量，油门倾角补偿用，太大会导致过补偿
#define  Thr_Fly_Start  1250//起飞油门量 1250
#define  Thr_Min 1000
#define  Thr_Idle 1180//油门怠速，取接近起转油门值即可
#define  Nav_Speed_Max  500//最大期望水平速度为5m/s



#include "control_althold.h"
#include "control_poshold.h"
#include "control_land.h"

#endif

